{
  "ActiveFiltersBar": "A horizontally scrollable filter bar with removable tags, clear all functionality, and navigation controls; **Anti-Pattern:** DO NOT use when filters are empty as the component returns null automatically.",
  "Alert": "A compact alert component with colored backgrounds, warning icons, and text content for notifications; **Crucial Rule:** ALWAYS displays a solid colored background (warning/secondary/error) and NEVER renders without proper variant styling.",
  "AlertMultiline": "A multi-line alert component supporting lists, links, buttons, and info tooltips with warning icon and customizable content; **Anti-Pattern:** DO NOT use for single simple messages - use the standard Alert component instead.",
  "AvatarDriver": "A driver avatar displaying profile photo, name, license plate, and optional transportation icon in a horizontal layout; **Crucial Rule:** ALWAYS requires a license plate prop and NEVER renders driver information without proper photo dimensions.",
  "Avatar": "A versatile avatar component that displays user photos with fallback to colored initials when images fail to load; **Crucial Rule:** ALWAYS uses a solid colored background with white text for initials and NEVER renders without proper size dimensions.",
  "BadgeStatus": "A rounded status badge with solid colored backgrounds for indicating states; **Anti-Pattern:** DO NOT use for status text that consists only of an icon and colored text without a background.",
  "TagBubble": "A rounded tag bubble with optional remove button for filter tags and selectable items; **Anti-Pattern:** DO NOT use for status indicators that require background colors - use BadgeStatus instead.",
  "BannerCarousel": "An autoplay banner carousel with navigation controls, dot indicators, and external link support; **Crucial Rule:** ALWAYS requires banner image URLs and NEVER renders empty - returns null when no banners provided.",
  "BottomSheet": "A mobile-first bottom sheet modal with header, content, and footer sections built on Vaul primitives; **Anti-Pattern:** DO NOT use for desktop-centric modals - use Modal component instead.",
  "InfoBottomsheet": "A specialized bottom sheet for displaying information content with standardized layout; **Crucial Rule:** ALWAYS includes a close button and NEVER renders without proper content structure.",
  "RadioBottomsheet": "A bottom sheet containing radio button selections with proper form validation; **Anti-Pattern:** DO NOT use for simple selections without radio functionality - use standard form controls instead.",
  "Breadcrumb": "A hierarchical navigation component showing the current page path with clickable links; **Crucial Rule:** ALWAYS includes the current page as non-clickable text and NEVER renders without proper breadcrumb items.",
  "Button": "A versatile button component with multiple visual variants for MuatTrans and MuatParts applications; **Anti-Pattern:** DO NOT use without proper variant specification as it defaults to muattrans-primary styling.",
  "Calendar": "A date selection calendar with Indonesian locale, custom day buttons, and range selection support; **Crucial Rule:** ALWAYS uses Indonesian date formatting and NEVER renders without proper locale configuration.",
  "DataTableBO": "A comprehensive data table component with search, pagination, sorting, and responsive design; **Crucial Rule:** ALWAYS requires properly formatted data arrays and column definitions and NEVER renders without table configuration.",
  "DateTimePickerResponsive": "A responsive date-time picker that adapts layout for mobile and desktop screens; **Anti-Pattern:** DO NOT use without proper responsive design considerations - always test on both mobile and desktop.",
  "DateTimePickerWeb": "A web-specific date-time picker optimized for desktop interactions; **Crucial Rule:** ALWAYS designed for desktop use and NEVER used in mobile contexts.",
  "DatePickerResponsive": "A mobile-first date picker using native date input with Indonesian formatting and validation; **Crucial Rule:** ALWAYS uses native date picker functionality and NEVER renders without proper date formatting.",
  "DatePickerWeb": "A web date picker with popover calendar interface and auto-apply functionality; **Crucial Rule:** ALWAYS includes calendar popover with date selection and NEVER renders without proper date handling.",
  "FileUploadButton": "A comprehensive file upload button with progress tracking, validation, and preview functionality; **Crucial Rule:** ALWAYS includes file validation and proper error handling and NEVER accepts files without type checking.",
  "PhoneInput": "An international phone number input with country selection, validation, and formatting; **Crucial Rule:** ALWAYS includes country code selection and proper phone number formatting and NEVER renders without proper validation.",
  "TableBO": "A flexible table component with sortable headers, hover states, and responsive design; **Crucial Rule:** ALWAYS requires proper column definitions and NEVER renders without table structure configuration.",
  "ConditionalDiv": "A conditional wrapper component that renders its children only when conditions are met; **Anti-Pattern:** DO NOT use for simple conditional rendering - use standard React conditional patterns instead.",
  "BarChart": "A responsive bar chart component with customizable data and interactive tooltips; **Crucial Rule:** ALWAYS requires properly formatted data arrays and NEVER renders empty.",
  "DonutChart": "A donut chart component for displaying proportional data with interactive segments; **Anti-Pattern:** DO NOT use for time-series data - use LineChart instead.",
  "LineChart": "A line chart with area fill and interactive tooltips for displaying trends over time; **Crucial Rule:** ALWAYS requires properly formatted income/date data and NEVER renders without proper axis configuration.",
  "Collapsible": "A collapsible component with smooth animations for expanding/collapsing content; **Anti-Pattern:** DO NOT use without proper trigger mechanisms - always provide clear user controls.",
  "CropperPreviewResponsive": "A responsive image cropper preview that adapts to different screen sizes; **Crucial Rule:** ALWAYS maintains aspect ratio constraints and NEVER renders without proper image data.",
  "CropperPreviewScreen": "A full-screen image cropper preview with zoom and pan capabilities; **Anti-Pattern:** DO NOT use without proper user controls for navigation.",
  "CropperResponsive": "A responsive image cropping component with mobile and desktop adaptations; **Crucial Rule:** ALWAYS includes aspect ratio controls and NEVER renders without proper image source.",
  "CropperScreen": "A full-screen image cropping interface with comprehensive editing tools; **Anti-Pattern:** DO NOT use for simple image uploads - use basic cropper components instead.",
  "CropperWeb": "A web-optimized image cropper with desktop-specific interactions; **Crucial Rule:** ALWAYS designed for desktop use and NEVER used in mobile contexts.",
  "CropperWebNew": "An enhanced web image cropper with improved user interface and features; **Anti-Pattern:** DO NOT use without proper error handling for image processing.",
  "DisplayOptionsBar": "A toolbar for switching between different display modes (grid/list/etc); **Crucial Rule:** ALWAYS includes active state indicators and NEVER renders without display options.",
  "Dropdown": "A flexible dropdown system with nested hover menus, filter triggers, and positioning controls; **Anti-Pattern:** DO NOT use without proper accessibility attributes - always include ARIA labels and keyboard navigation.",
  "DropdownMenu": "A specialized dropdown menu component with item selection capabilities; **Crucial Rule:** ALWAYS includes proper item selection handlers and NEVER renders without menu items.",
  "SimpleDropdownMenu": "A simplified dropdown menu for basic selection scenarios; **Anti-Pattern:** DO NOT use for complex nested menus - use the full Dropdown component instead.",
  "SimpleDropdown": "A simplified dropdown component built on SimpleDropdownMenu with trigger and items support; **Crucial Rule:** ALWAYS requires proper trigger element and item array for rendering.",
  "Dropzone": "A file upload dropzone with drag-and-drop functionality and progress tracking; **Crucial Rule:** ALWAYS includes file validation and NEVER accepts files without proper type checking.",
  "ResponsiveFooter": "A responsive footer component that adapts layout and content for mobile and desktop; **Anti-Pattern:** DO NOT use without proper responsive breakpoints - always test on all screen sizes.",
  "ButtonPlusMinus": "A plus/minus button component for increment/decrement operations; **Crucial Rule:** ALWAYS includes value validation and NEVER allows invalid number ranges.",
  "Checkbox": "A standard checkbox component with proper form integration and styling; **Anti-Pattern:** DO NOT use without proper form context - always include name and value attributes.",
  "DimensionInput": "A specialized input for dimensions with unit conversion support; **Crucial Rule:** ALWAYS includes unit validation and NEVER accepts invalid dimension formats.",
  "Form": "A comprehensive form component with validation, error handling, and submission management; **Anti-Pattern:** DO NOT use without proper validation rules - always include error states.",
  "Input": "A versatile input component with icons, error handling, and reset functionality; **Crucial Rule:** ALWAYS includes proper validation states and NEVER renders without proper type attributes.",
  "NumberInput": "A number-specific input with validation, min/max constraints, and formatting; **Anti-Pattern:** DO NOT use without proper number validation - always validate input ranges.",
  "OtpInput": "A one-time password input with automatic focus advancement and paste support; **Crucial Rule:** ALWAYS maintains exact character count and NEVER allows partial OTP submission.",
  "RatingInput": "A star rating input component with fractional rating support; **Anti-Pattern:** DO NOT use without proper value persistence - always include current rating state.",
  "Select": "A dropdown select component with search, grouping, and custom rendering; **Crucial Rule:** ALWAYS includes proper option handling and NEVER renders without options array.",
  "TagInput": "An input component for adding/removing tags with validation; **Anti-Pattern:** DO NOT use without proper tag validation - always validate tag formats.",
  "TextArea": "A multi-line text input with character counting and validation; **Crucial Rule:** ALWAYS includes proper row/column attributes and NEVER renders without proper validation.",
  "SimpleHoverMenu": "A simple hover-activated menu with basic navigation items; **Anti-Pattern:** DO NOT use without proper hover delay - always include reasonable timing.",
  "IconComponent": "A versatile icon component supporting multiple formats and loading states; **Crucial Rule:** ALWAYS includes proper alt text and NEVER renders without valid icon sources.",
  "ImageComponent": "An enhanced image component with loading states, error handling, and optimization; **Anti-Pattern:** DO NOT use without proper image dimensions - always include width/height attributes.",
  "Lightbox": "An image lightbox with zoom, navigation, and full-screen viewing capabilities; **Crucial Rule:** ALWAYS includes keyboard navigation support and NEVER traps focus without proper escape handling.",
  "LoadingInteractive": "An interactive loading component with progress indicators and user controls; **Anti-Pattern:** DO NOT use without proper cancellation mechanisms - always allow user interruption.",
  "LoadingStatic": "An SSR-friendly loading overlay that always renders full-screen with backdrop blur; **Crucial Rule:** NEVER removes itself programmatically - requires parent component to control visibility.",
  "MapContainer": "A map container component with basic map functionality; **Anti-Pattern:** DO NOT use without proper map provider configuration - always include API keys and settings.",
  "MapWithPath": "A map component with route path visualization and location markers; **Crucial Rule:** ALWAYS requires proper coordinate data and NEVER renders without valid path information.",
  "ConfirmationModal": "A specialized modal for confirmations with standardized action buttons; **Anti-Pattern:** DO NOT use without proper confirmation handlers - always include cancel/confirm actions.",
  "ConfirmationModalResponsive": "A responsive confirmation modal that adapts to different screen sizes; **Crucial Rule:** ALWAYS includes mobile-optimized buttons and NEVER renders without proper responsive breakpoints.",
  "Modal": "A comprehensive modal system with controlled/uncontrolled states and multiple variants; **Anti-Pattern:** DO NOT use without proper accessibility attributes - always include ARIA labels and focus management.",
  "NotificationCount": "A notification count badge with customizable styling and positioning; **Crucial Rule:** ALWAYS displays numeric counts and NEVER renders without proper count values.",
  "NotificationDot": "A simple notification dot indicator for unread states; **Anti-Pattern:** DO NOT use for numeric counts - use NotificationCount instead.",
  "Popover": "An accessible popover component with proper positioning and trigger mechanisms; **Crucial Rule:** ALWAYS includes proper close mechanisms and NEVER traps focus without proper escape handling.",
  "RadioButton": "A radio button component with proper form integration and group management; **Anti-Pattern:** DO NOT use without proper name attributes - always group radio buttons correctly.",
  "ScrollArea": "A custom scroll area component with styled scrollbars and overflow handling; **Anti-Pattern:** DO NOT use without proper overflow configuration - always set appropriate scroll behavior.",
  "Timeline": "A versatile timeline component for displaying sequential events with different variants; **Anti-Pattern:** DO NOT use without proper event ordering - always maintain chronological sequence.",
  "Toaster": "A global toast notification system with responsive positioning and animations; **Crucial Rule:** NEVER renders without proper store context and ALWAYS requires Zustand store integration.",
  "InfoTooltip": "An informational tooltip with HTML content support and proper positioning; **Anti-Pattern:** DO NOT use without proper trigger mechanisms - always include clear hover/focus states."
}
