{
  "AddImage": "A plus sign overlaid on an image placeholder with a small circle in the corner, used for adding or uploading new images to a gallery or form.",
  "AgendaArmada": "A calendar icon with dots representing dates, used for scheduling or managing fleet appointments and timetables.",
  "AmandemenTender": "A document with a balance scale symbol, used for representing tender amendments or contract modifications.",
  "ArrowDown": "A downward-pointing arrow icon, typically used for navigation to scroll down or expand content sections.",
  "ArrowLeft": "A left-pointing arrow icon, typically used for navigation to go back or move to previous items.",
  "ArrowRight": "A right-pointing arrow icon, typically used for navigation to proceed forward or move to next items.",
  "ArrowUp": "An upward-pointing arrow icon, typically used for navigation to scroll up or collapse content sections.",
  "AsuransiBarang": "A shield with a checkmark inside, used for representing insurance coverage or protection for goods.",
  "BadanUsaha": "A briefcase with a handle on top, used for representing business entities or corporate organizations.",
  "Bengkel": "A wrench crossed with a hammer inside a box, used for representing workshop services or vehicle maintenance.",
  "Berat": "A weight scale with 'KG' text, used for representing weight measurement or cargo mass information.",
  "Bintang": "A five-pointed star outline, used for rating systems, favorites, or special achievements.",
  "BintangSolid": "A filled five-pointed star, used for active ratings, selected favorites, or highlighted achievements.",
  "Blue1": "A blue circular badge with the number '1' in white, used for sequential numbering or priority indicators.",
  "Blue2": "A blue circular badge with the number '2' in white, used for sequential numbering or priority indicators.",
  "Blue3": "A blue circular badge with the number '3' in white, used for sequential numbering or priority indicators.",
  "Blue4": "A blue circular badge with the number '4' in white, used for sequential numbering or priority indicators.",
  "Blue5": "A blue circular badge with the number '5' in white, used for sequential numbering or priority indicators.",
  "Blue6": "A blue circular badge with the number '6' in white, used for sequential numbering or priority indicators.",
  "Bookmark": "An outlined bookmark shape with a pointed bottom, used for saving or marking important content for later reference.",
  "BookmarkSolid": "A filled bookmark shape with a pointed bottom, used for indicating saved or bookmarked content.",
  "BoxOpen": "An open cardboard box with flaps extended upward, used for representing packaging, shipping, or delivery services.",
  "Building": "A multi-story building with windows, used for representing office buildings, corporate headquarters, or real estate.",
  "Calendar": "A calendar grid with a header and date squares, used for scheduling, date selection, or event planning.",
  "Call": "A telephone handset icon, used for initiating phone calls or contact information.",
  "Camera": "A camera with a circular lens in the center, used for photography, image capture, or camera settings.",
  "Cart": "A shopping cart with wheels and a handle, used for e-commerce, product selection, or checkout processes.",
  "CatatanAmandemen": "A notepad with lines and a pen, used for documenting amendments or recording modification notes.",
  "Chat": "Two overlapping speech bubbles, used for messaging, conversations, or communication features.",
  "Check": "A circle with a checkmark inside, used for confirming completion, approval, or successful actions.",
  "Checklist": "A filled circle with a white checkmark, used for completed tasks, verified items, or approved status.",
  "ChevronDown": "A V-shaped arrow pointing downward, used for expanding content, dropdown menus, or showing more options.",
  "ChevronLeft": "A left-pointing chevron arrow, used for navigation to previous pages, back buttons, or carousel controls.",
  "ChevronRight": "A right-pointing chevron arrow, used for navigation to next pages, forward buttons, or carousel controls.",
  "ChevronUp": "A V-shaped arrow pointing upward, used for collapsing content, minimizing sections, or scrolling to top.",
  "CircleCross": "A circle with an X inside, used for closing, canceling, or removing items.",
  "CreditCard": "A rectangular card with horizontal lines, used for payment methods, billing information, or financial transactions.",
  "DaftarKontrak": "A document with lines and a folded corner, used for contract lists, agreements, or legal documents.",
  "DaftarPermintaanSolid": "A clipboard with bullet points, used for request lists, order forms, or task management.",
  "DaftarPesananManual": "A document with lines and a pencil, used for manual order entry or handwritten order processing.",
  "DaftarPesananPlus": "A shopping basket with a plus sign, used for adding new orders or creating additional purchase requests.",
  "Dashboard": "Four square grid layout, used for dashboard interfaces, analytics overview, or main navigation menus.",
  "DashboardMuatrans": "A square with an upward trending arrow, used for logistics dashboards, transportation analytics, or growth metrics.",
  "Detail": "A document with a magnifying glass, used for viewing details, inspection, or document analysis.",
  "Diskusi": "Two speech bubbles overlapping, used for discussions, comments, or collaborative communication.",
  "DocumentDownload": "A document with a downward arrow, used for downloading files, exporting data, or saving documents.",
  "DocumentDownloadSolid": "A filled document with a download arrow, used for active download processes or file retrieval.",
  "DocumentUpload": "A document with an upward arrow, used for uploading files, importing data, or submitting documents.",
  "DocumentUploadSolid": "A filled document with an upward arrow, used for uploading files, importing data, or submitting documents.",
  "DokumenDikirim": "A document with a checkmark in a circle, used for indicating sent documents, completed submissions, or delivered files.",
  "DokumenSedangDisiapkan": "A document with checklist items, used for indicating documents being prepared, pending processing, or in-progress tasks.",
  "DownCircle": "A circle with a downward arrow, used for downloading, expanding content, or navigating to lower sections.",
  "Download": "A downward arrow with a base line, used for downloading files, retrieving data, or saving content.",
  "Driver": "A steering wheel icon, used for representing drivers, transportation services, or vehicle operators.",
  "DiumumkanKepada": "A person icon with a megaphone, used for announcements, notifications, or broadcasting information.",
  "Edit": "A pencil icon, used for editing content, modifying information, or making changes.",
  "EkspektasiDestinasi": "A document with a checkmark, used for destination expectations, delivery confirmations, or location verification.",
  "Email": "An envelope icon, used for email communication, messaging, or contact information.",
  "EstimasiKapasitas": "A truck with measurement indicators, used for capacity estimation, load planning, or volume calculation.",
  "Etalase": "A grid layout icon, used for product display, catalog view, or showcase arrangement.",
  "EyeClosed": "An eye with a slash, used for hiding content, password visibility toggle, or private information.",
  "EyeOpen": "An open eye icon, used for viewing content, password visibility toggle, or revealing information.",
  "FakturPajak": "A receipt with jagged top, used for tax invoices, financial documents, or billing records.",
  "Filter2": "Three horizontal lines with sliders, used for filtering options, data sorting, or content refinement.",
  "Galeri": "A play button icon, used for media gallery, video playback, or content viewing.",
  "Garasi": "A building with a garage door, used for garage facilities, parking areas, or vehicle storage.",
  "Gift": "A gift box with ribbon, used for rewards, special offers, or promotional items.",
  "Gps": "A location pin with circles, used for GPS tracking, location services, or navigation.",
  "Grey1": "A gray circle with number 1, used for step indicators, numbering, or sequence markers.",
  "Grey2": "A gray circle with number 2, used for step indicators, numbering, or sequence markers.",
  "Grey3": "A gray circle with number 3, used for step indicators, numbering, or sequence markers.",
  "Grey4": "A gray circle with number 4, used for step indicators, numbering, or sequence markers.",
  "Grey5": "A gray circle with number 5, used for step indicators, numbering, or sequence markers.",
  "Grey6": "A gray circle with number 6, used for step indicators, numbering, or sequence markers.",
  "HandPrice": "A hand holding currency symbols, used for pricing, payment options, or cost information.",
  "Heart": "An outlined heart shape, used for favorites, likes, or preference selection.",
  "HeartRed": "A filled red heart, used for favorites, likes, or preference selection.",
  "HelpSolid": "A circle with a question mark, used for help information, support, or guidance.",
  "Home": "A house icon, used for home page, main navigation, or primary location.",
  "IconName159": "A circular arrow icon, used for refresh, sync, or update operations.",
  "IconName167": "An envelope with a downward arrow, used for message delivery, email sending, or communication.",
  "InboxWhite": "A speech bubble with lines, used for inbox, messages, or communication center.",
  "Incoterms": "A document with a checkmark, used for trade terms, shipping conditions, or commercial agreements.",
  "Info": "A circle with an information symbol, used for help, details, or additional information.",
  "InfoPraTender": "A document with lines, used for pre-tender information, bidding details, or procurement data.",
  "InstantOrder": "A delivery truck, used for instant ordering, quick delivery, or express shipping.",
  "Kapasitas": "A container with measurement lines, used for capacity, volume, or storage indicators.",
  "KelolaKontrak": "A document with lines, used for contract management, agreement handling, or legal documents.",
  "KelolaPesanan": "A clipboard with lines, used for order management, processing requests, or task tracking.",
  "KelolaPesananSolid": "A filled clipboard with lines, used for order management, processing requests, or task tracking.",
  "KelolaProduk": "A shopping bag with handle, used for product management, inventory control, or item cataloging.",
  "Kesehatan": "A heart with a pulse line, used for health monitoring, medical information, or wellness tracking.",
  "Komentar": "A speech bubble with a heart, used for comments, feedback, or user engagement.",
  "KonfirmasiSiap": "A truck with a checkmark, used for delivery confirmation, readiness status, or shipment verification.",
  "KontakPerusahaan": "An address book icon, used for company contacts, business information, or corporate directory.",
  "LanggananFilled": "A crown icon, used for subscription, premium services, or membership status.",
  "LanggananOutline": "An outlined crown icon with a base, used for subscription services, membership plans, or premium features.",
  "Language": "A globe with language symbols and directional arrows, used for language selection, translation, or internationalization.",
  "Laporan": "A document with a magnifying glass and checkmarks, used for report generation, document analysis, or data verification.",
  "LaporanDanEksekusiTender": "A document with checkmarks and a pen, used for tender report generation and execution tracking.",
  "LaporanMuatrans": "A document with lines and a bookmarked bottom edge, used for transportation reports or shipping documentation.",
  "LayananTambahan": "A heart with a plus sign, used for additional services, extra features, or service upgrades.",
  "Link": "Two interlinked chain segments, used for hyperlink creation, connection establishment, or relationship linking.",
  "Lock": "A padlock with a keyhole, used for security features, access control, or privacy protection.",
  "Logout": "A door with an arrow pointing outward, used for sign-out functionality, session termination, or user exit.",
  "Lokasi": "A location pin with a circular center, used for location services, mapping, or geographical positioning.",
  "LokasiSolid": "A filled location pin with a circular center, used for location services, mapping, or geographical positioning.",
  "ManArmada": "A truck with wheels and details, used for fleet management, vehicle tracking, or transportation services.",
  "ManDriver": "Multiple simplified human figures, used for driver management, team coordination, or personnel tracking.",
  "ManajemenLokasi": "A location pin with a map marker, used for location management, site administration, or place organization.",
  "ManajemenLokasiPart2": "A map with location pins and a building, used for advanced location management or site mapping.",
  "ManajemenMitra": "Multiple human figures with checkmarks, used for partner management, collaboration tracking, or relationship administration.",
  "ManajemenNotifikasi": "A bell with sound waves, used for notification management, alert configuration, or message settings.",
  "ManajemenRole": "A human figure with gear icons, used for role management, permission settings, or access control administration.",
  "ManajemenUser": "Multiple human figures in a hierarchical arrangement, used for user management, team administration, or personnel organization.",
  "Menu": "Three vertically aligned dots, used for menu navigation, options display, or additional actions.",
  "MenunguPo": "A document with a clock and checkmark, used for purchase order waiting status or pending approval.",
  "MinSquare": "A square with a horizontal line, used for minimization, reduction, or decrease functions.",
  "Minus": "A horizontal line, used for subtraction, removal, or decrease operations.",
  "Monitoring": "A computer monitor with a stand, used for system monitoring, dashboard display, or screen viewing.",
  "Move": "Four arrows pointing in different directions, used for drag-and-drop, element movement, or position adjustment.",
  "Muatan": "A three-dimensional box with visible edges, used for cargo management, shipping containers, or load tracking.",
  "NoPolisi": "A license plate with X marks, used for vehicle registration, police identification, or traffic enforcement.",
  "NomorAmandemen": "A document with a number one, used for amendment numbering, version tracking, or document revision.",
  "NotifWhite": "A white bell with notification dots, used for white-themed notification alerts or message indicators.",
  "Notification": "A bell in a circle with sound waves, used for notification alerts, message indicators, or alarm functions.",
  "OrderEntry": "Two documents with a pen, used for order entry, form filling, or data input operations.",
  "PaketLangganan": "A hexagon with a person icon, used for subscription packages, membership plans, or service bundles.",
  "PaketSolid": "A filled hexagon with a person icon, used for premium subscription packages or exclusive service bundles.",
  "Pelabuhan": "A ship with waves and containers, used for port management, shipping services, or maritime operations.",
  "Pemenang": "A trophy with a star, used for winner identification, achievement display, or competition results.",
  "PemenangTender": "A trophy with an upward arrow, used for tender winner announcement or bid success indication.",
  "Pemintaan": "A document with an upward arrow, used for request submission, application filing, or petition processing.",
  "Pengaturan": "A gear with circular patterns, used for settings, configuration options, or system adjustments.",
  "PengaturanAkun": "A person with gear icons, used for account settings, profile configuration, or user preferences.",
  "PeriodeTender": "A calendar with bidirectional arrows, used for tender period management, deadline tracking, or time scheduling.",
  "Permintaan": "A document with an upload arrow, used for request submission, file uploading, or application processing.",
  "PilihLokasi": "A target with concentric circles, used for location selection, map targeting, or position picking.",
  "Plus": "A plus sign with equal-length arms, used for addition, creation, or expand functions.",
  "PlusSquare": "A square with a plus sign, used for adding items, creating new elements, or expansion options.",
  "Po": "A document with a checkmark and lines, used for purchase order confirmation, order processing, or transaction approval.",
  "Portion": "A divided circle with segments, used for portion control, division management, or resource allocation.",
  "PosisiTruk": "A truck with location indicators, used for truck positioning, vehicle tracking, or fleet monitoring.",
  "ProfilPerusahaan": "A building with grid lines, used for company profile, business information, or organizational details.",
  "Profile": "A person silhouette icon, used for user profiles, account information, or personal settings.",
  "ProfileCircle": "A person silhouette inside a circle, used for user avatars, profile pictures, or account representation.",
  "Promo": "A percentage symbol within a rectangular frame, used for discounts, promotions, or special offers.",
  "Provinsi": "A map outline of Indonesia, used for regional selection, location services, or geographic data representation.",
  "PusatBantuan": "A help center icon with a person and speech bubble, used for customer support, help desk, or assistance services.",
  "Qris": "A QR code payment icon with grid pattern, used for digital payments, QR scanning, or cashless transactions.",
  "Read": "A checkmark icon with curved lines, used for read receipts, message confirmation, or task completion.",
  "Restart": "A circular arrow icon pointing counterclockwise, used for refresh, restart, or reload actions.",
  "Rute": "A route icon with location pins and connecting path, used for navigation, directions, or journey planning.",
  "Salin": "A document copy icon with overlapping pages, used for duplicate, copy, or clone functions.",
  "Salin2": "A tag or label icon with a hole, used for categorization, labeling, or tagging items.",
  "SalinQrc": "A chain link icon with interlocking loops, used for connections, relationships, or linking content.",
  "Search": "A magnifying glass icon, used for search functionality, finding content, or filtering options.",
  "Share": "A network of connected circles, used for sharing content, social media, or distribution features.",
  "Shield": "A shield icon with a checkmark, used for security, protection, or verified status.",
  "Shipper": "A truck icon with cargo, used for shipping, delivery services, or logistics management.",
  "SidebarHide": "A left-pointing arrow within a panel, used to hide sidebars, collapse menus, or minimize navigation.",
  "SidebarShow": "A right-pointing arrow within a panel, used to show sidebars, expand menus, or maximize navigation.",
  "Silang": "An X mark icon, used for closing, canceling, or removing elements.",
  "SortAscending": "An upward-pointing arrow, used for ascending sort order, arranging from A-Z or low to high.",
  "SortDescending": "A downward-pointing arrow, used for descending sort order, arranging from Z-A or high to low.",
  "Sorting": "Dual arrows pointing up and down, used for sorting options, ordering data, or arranging lists.",
  "Stopwatch": "A timer icon with a circular face and buttons, used for time tracking, countdown, or duration measurement.",
  "Tabel": "A grid icon with rows and columns, used for tables, data display, or spreadsheet representation.",
  "Tender": "A document with a checkmark, used for proposals, bids, or tender submissions.",
  "Testimoni": "Speech bubbles with quotation marks, used for testimonials, reviews, or customer feedback.",
  "Time": "A clock icon with hands and numbers, used for time display, scheduling, or appointment settings.",
  "TopikAmandemen": "A document with lines and a corner fold, used for amendments, revisions, or document editing.",
  "Transfer": "Arrows pointing between rectangles, used for transfer operations, moving data, or exchanging items.",
  "TransferBank": "Circular arrows with a currency symbol, used for bank transfers, money movement, or financial transactions.",
  "Transporter": "A delivery truck icon, used for transportation, delivery services, or logistics operations.",
  "TrashBin": "A trash can icon, used for delete, remove, or discard functions.",
  "Troli": "A shopping cart icon, used for e-commerce, product selection, or checkout process.",
  "TroliSolid": "A filled shopping cart icon, used for e-commerce, product selection, or checkout process.",
  "Uang": "A wallet or money bag icon, used for finances, payments, or monetary transactions.",
  "UbahArmada": "A truck with a refresh symbol, used for changing vehicles, updating fleet, or modifying transport options.",
  "Unlink": "A broken chain link icon, used for disconnecting, unlinking, or breaking associations.",
  "UpdateStatus": "A status update icon with arrows, used for changing states, updating information, or progress tracking.",
  "Verified": "A starburst with a checkmark, used for verification, authentication, or confirmed status.",
  "Verifikasi": "A shield with a checkmark, used for verification, security validation, or authentication processes.",
  "Voucher": "A ticket or coupon icon, used for discounts, promotions, or special offers.",
  "Wallet2": "A wallet icon with cards, used for digital payments, financial management, or e-wallet services.",
  "Warning": "A triangular warning sign with an exclamation mark, used for alerts, cautions, or important notices.",
  "WarningCircle": "A circle with an exclamation mark, used for warnings, alerts, or attention-required messages.",
  "WarningSegitiga": "A triangle with an exclamation mark, used for warnings, cautions, or important notifications.",
  "Whatsapp": "The WhatsApp logo icon, used for WhatsApp messaging, communication, or social media integration.",
  "Zoom": "Four arrows pointing outward, used for zoom, expand, or maximize view functions.",
  "ZoomIn": "A plus sign within a magnifying glass, used for zoom in, enlarge, or increase view size.",
  "ZoomOut": "A minus sign within a magnifying glass, used for zoom out, reduce, or decrease view size."
}
